# ParameterSet Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterSet Constructor
ParameterSet Class See Also
---
Initializes a new instance of the ParameterSet class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ParameterSet()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ParameterSet()
```

# See Also
ParameterSet Class
Autodesk.Revit.DB Namespace